<?php global $dbh; ?>
<?php

// Підключення до бази даних
include $_SERVER["DOCUMENT_ROOT"] . "/connection_database.php";

// Перевірка, чи переданий ідентифікатор користувача
if (isset($_GET['id']) && !empty($_GET['id'])) {
    $id = $_GET['id'];

    // Підготовка SQL-запиту для видалення користувача
    $sql = "DELETE FROM users WHERE id = :id";
    $stmt = $dbh->prepare($sql);

    // Прив'язка параметрів та виконання запиту
    $stmt->bindParam(':id', $id);
    $stmt->execute();

    // Перенаправлення на головну сторінку або іншу сторінку, де ви плануєте перейти після видалення
    header("Location: /index.php"); // Замініть на шлях, куди потрібно перенаправити користувача
    exit();
} else {
    // Якщо ідентифікатор не передано або порожній, перенаправлення на головну сторінку або сторінку помилки
    header("Location: /"); // Замініть на шлях, куди потрібно перенаправити користувача
    exit();
}

